app/controllers/web/admin/bulletins_controller.rb

SELECT "bulletins".* FROM "bulletins" ORDER BY "bulletins"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
---
  def index
    get_query('bulletin')
    @tabs = %w[all under_moderation draft published rejected archived]
    @active_tab = params[:tab] || 'all'

    @q = Bulletin.ransack(@query)
    @bulletins = @q.result.order(created_at: :desc).includes(:user).page(params[:page]).send(@active_tab)

SELECT "bulletins".* FROM "bulletins" WHERE "bulletins"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def reject
    bulletin = Bulletin.find(params[:id])

SELECT "bulletins".* FROM "bulletins" WHERE "bulletins"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def publish
    bulletin = Bulletin.find(params[:id])