app/controllers/web/admin/categories_controller.rb

  def index
    authorize [:admin, Category]
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    authorize [:admin, Category]
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "g"], ["created_at", "2022-05-15 20:08:58.279661"], ["updated_at", "2022-05-15 20:08:58.279661"]]

  def destroy
    authorize [:admin, Category]
    @category = Category.find(params[:id])
    if @category.destroy
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 61], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 61]]