app/controllers/web/auth_controller.rb

  def callback
    auth = request.env['omniauth.auth']
    user = User.login_with_oauth(auth)
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "uid") VALUES (?, ?, ?, ?, ?)  [["name", "кайтек"], ["email", "mars.shamgulov@gmail.com"], ["created_at", "2022-05-03 19:20:08.817484"], ["updated_at", "2022-05-03 19:20:08.817484"], ["uid", "45975483"]]
UPDATE "users" SET "updated_at" = ?, "avatar_url" = ? WHERE "users"."id" = ?  [["updated_at", "2022-05-14 15:45:21.619897"], ["avatar_url", "https://avatars.githubusercontent.com/u/45975483?v=4"], ["id", 2]]