app/controllers/web/bulletins_controller.rb

UPDATE "bulletins" SET "updated_at" = ?, "state" = ? WHERE "bulletins"."id" = ?  [["updated_at", "2022-05-15 07:48:32.066790"], ["state", "under_moderation"], ["id", 6]]
---
  def update
    @bulletin = set_bulletin
    authorize @bulletin
    if @bulletin.update(bulletin_params)