app/controllers/web/bulletins_controller.rb

SELECT "bulletins".* FROM "bulletins" ORDER BY "bulletins"."created_at" DESC
---
  def index
    @bulletins = Bulletin.published.order(created_at: :desc)

INSERT INTO "bulletins" ("title", "description", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @bulletin = current_user.bulletins.new(bulletin_params)
    if @bulletin.save

UPDATE "bulletins" SET "updated_at" = ?, "state" = ? WHERE "bulletins"."id" = ?  [["updated_at", "2022-05-14 08:44:37.422088"], ["state", "under_moderation"], ["id", 1]]
---
  def update
    bulletin = set_bulletin
    if bulletin.update(bulletin_params)

SELECT "bulletins".* FROM "bulletins" WHERE "bulletins"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def set_bulletin
    Bulletin.find(params[:id])