app/controllers/web/profile_controller.rb

  def index
    @q = current_user.bulletins.ransack(params[:q])
    @bulletins = @q.result.order(created_at: :desc).page(params[:page]).per(10)
---
SELECT "bulletins".* FROM "bulletins" WHERE "bulletins"."user_id" = ? ORDER BY "bulletins"."created_at" DESC  [["user_id", 2]]